import numpy as np


def main():
    print("> 🚀 start numpy\n")
    # ----------------------------------------

    # # ----
    # print("1次元配列を作成")
    # a = np.array([1, 2, 3])
    # print(a)

    # # ----
    # print("2次元配列を作成")
    # a = np.array([[1, 2, 3], [4, 5, 6]])
    # print(a)

    # # ----
    # print("配列を作成,形を変更")
    # a = np.array([1, 2, 3, 4, 5, 6]).reshape(2, 3)  # reshape(縦,横)を指定
    # print(a)

    # # ----
    # print("一元配列に戻す")
    # b = a.flatten()  # コピーを返す
    # c = a.ravel()  # 参照を返す
    # print(b)
    # print(c)

    # # ----
    # print("データタイプ")
    # print(a.dtype)

    # ----
    print("======== 配列を作成")
    array = np.array([[1, 2, 3, 4], [2, 3, 4, 5]])
    print(f"array:{array}")
    print(f"array[0]:{array[0]}")
    print(f"array[1]:{array[1]}")
    # array:[[1 2 3 4]
    #  [2 3 4 5]]
    # array[0]:[1 2 3 4]
    # array[1]:[2 3 4 5]

    # ----
    print("======== 配列を作成(0で埋める)")
    print(np.zeros(3))
    # [0. 0. 0.]

    # ----
    print("======== 配列を作成(1で埋める)")
    print(np.ones(3))
    # [0. 0. 0.]

    # ----
    print("======== 配列を作成(値はメモリ上の値が埋設定される)")
    print(np.empty(3))
    # [1. 1. 1.] << 値はメモリ上の値が設定される

    # ----
    print("======== 配列を作成(要素の範囲で作成)")
    print(np.arange(4))
    # [0 1 2 3]
    print(np.arange(0, 10, 2))
    # [0 2 4 6 8] << 最後は含まれない

    # ----
    print("======== 配列を作成(指定した間隔で直線的に間隔を置いた値を持つ配列を作成)")
    print(np.linspace(0, 10, num=5))
    # [ 0.   2.5  5.   7.5 10. ] << 最後を含む

    # ----
    print("======== 配列を作成(データタイプの指定)")
    print(np.ones(2, dtype=np.int64))
    # [1 1]

    # ----
    print("======== 配列のソート")
    array = np.array([8, 2, 5, 1, 9, 3])
    print(np.sort(array))
    # [1 2 3 5 8 9]

    # ----
    print("======== 配列の連結")
    a1 = np.array([1, 2, 3, 4])
    a2 = np.array([5, 6, 7, 8])
    print(np.concatenate((a1, a2)))

    # ----
    print("======== 配列の連結2")
    x = np.array([[1, 2], [3, 4]])
    y = np.array([[5, 6]])
    print(np.concatenate((x, y)))

    # ----
    print("======== 配列の連結、次元、長さ、サイズ")
    array_example = np.array(
        [
            [[0, 1, 2, 3], [4, 5, 6, 7]],
            [[0, 1, 2, 3], [4, 5, 6, 7]],
            [[0, 1, 2, 3], [4, 5, 6, 7]],
        ],
    )
    print(f"==== 次元: {array_example.ndim}")
    # 次元: 3

    print(f"====要素数: {array_example.size}")
    # 要素数: 24

    print(f"====配列の形状: {array_example.shape}")
    # 配列の形状: (3, 2, 4)

    # ----
    print("======== 配列のリシェイプ")
    a = np.arange(6)
    print(a)
    # [0 1 2 3 4 5]
    b = a.reshape(3, 2)
    print(b)
    # [
    #  [0 1]
    #  [2 3]
    #  [4 5]
    # ]

    # ----
    print("======== 1次元配列を2次元配列に変換する方法（配列に新しい軸を追加する方法）")
    a1 = np.array([1, 2, 3, 4, 5, 6])
    print(a1.shape)
    # (6,)
    print(a1)
    # [1 2 3 4 5 6]

    print("==== 中身は変えずに、データに『行』という新しい枠組みを与えて2次元にする")
    a2 = a1[np.newaxis, :]
    print(a2.shape)
    # (1, 6)
    print(a2)
    # [
    #  [1 2 3 4 5 6]
    # ]

    print("====「列方向」に新しい軸を追加")
    a3 = a1[:, np.newaxis]
    print(a3.shape)
    # (6, 1)
    print(a3)
    # [
    #  [1]
    #  [2]
    #  [3]
    #  [4]
    #  [5]
    #  [6]
    # ]

    print("==== indexの位置1に軸を追加")
    a4 = np.expand_dims(a1, axis=1)
    print(a4.shape)
    # (6, 1)
    print(a4)
    # [
    #  [1]
    #  [2]
    #  [3]
    #  [4]
    #  [5]
    #  [6]
    # ]

    print("==== indexの位置0に軸を追加")
    a5 = np.expand_dims(a1, axis=0)
    print(a5.shape)
    # (1, 6)
    print(a5)
    # [
    #  [1 2 3 4 5 6]
    # ]

    print("======== インデックスとスライス")
    data = np.array([1, 2, 3])
    print(data[1])
    # 2
    print(data[0:2])
    # [1 2]
    print(data[1:])
    # [2 3]
    print(data[-1])
    # 3
    print(data[-2:])
    # [2 3]

    print("==== 条件抽出")
    a1 = np.array([[1, 2, 3, 4], [5, 6, 7, 8], [9, 10, 11, 12]])
    print(a1[a1 < 5])

    print("==== 条件抽出2")
    print(a1[(a1 > 2) & (a1 < 11)])

    print("==== 条件抽出3")
    five_up = (a1 > 5) | (a1 == 5)
    print(five_up)

    # 一旦ここまで
    # https://qiita.com/DeepTama/items/0aa2c4840571ba789e85#%E3%82%A4%E3%83%B3%E3%83%87%E3%83%83%E3%82%AF%E3%82%B9%E3%81%A8%E3%82%B9%E3%83%A9%E3%82%A4%E3%82%B9

    # ----------------------------------------
    print("\n< ✨️ end numpy")


if __name__ == "__main__":
    main()
